# авдання 1
# Маємо три кортежі цілих чисел. Знайдіть елементи, які унікальні для кожного списку.
tuple1 = (1, 2, 3, 4, 5)
tuple2 = (3, 4, 5, 6, 7)
tuple3 = (5, 6, 7, 8, 9)
print("Унікальні для першого:", set(tuple1) - set(tuple2) - set(tuple3))
print("Унікальні для другого:", set(tuple2) - set(tuple1) - set(tuple3))
print("Унікальні для третього:", set(tuple3) - set(tuple1) - set(tuple2))
# Завдання 2
# Маємо три кортежі цілих чисел. Знайдіть елементи, які
# є в кожному з кортежів і знаходяться в кожному з них на тій самій позиції.
tuple1 = (1, 2, 3, 4, 5)
tuple2 = (1, 6, 3, 8, 5)
tuple3 = (1, 9, 3, 4, 5)
for i in range(len(tuple1)):
    if tuple1[i] == tuple2[i] == tuple3[i]:
        print(tuple1[i])
# Завдання 3
# Маємо кортеж з цілими числами. Виведіть статистику за кількістю цифр в елементах кортежу.
# Наприклад:
# Одна цифра — 3 елементи
# Дві цифри — 4 елементи
# Три цифри — 5 елементів
numbers = (1, 12, 345, 6789, 8, 55, 999, 10000)
one = 0
two = 0
three = 0
four = 0
five = 0
for num in numbers:
    length = len(str(num))
    if length == 1:
        one += 1
    elif length == 2:
        two += 1
    elif length == 3:
        three += 1
    elif length == 4:
        four += 1
    elif length == 5:
        five += 1
print("Одна цифра -", one)
print("Дві цифри -", two)
print("Три цифри -", three)
print("Чотири цифри -", four)
print("П'ять цифр -", five)
# Завдання 4
# Напишіть програму, яка приймає список кортежів (ім'я, вік) та виводить лише ті імена, у яких вік
# більше 18.
# Приклад вхідних даних: [("Ганна", 22), ("Іван", 16), ("Марія", 20), ("Петро", 25)]
# Очікуваний висновок: Анна Марія Петро
people = (
    ("Ганна", 22),
    ("Іван", 16),
    ("Марія", 20),
    ("Петро", 25)
)
for person in people:
    if person[1] > 18:
        print(person[0])
# Завдання 5
# Напишіть програму, яка приймає список кортежів (назва товару, кількість) та вважає загальну
# кількість товарів.
# Приклад вхідних даних: [('Яблука', 10), ('Молоко', 5), ('Хліб', 3), ('Масло', 2)]
# Очікуваний висновок: Загальна кількість товарів: 20
products = (
    ("Яблука", 10),
    ("Молоко", 5),
    ("Хліб", 3),
    ("Масло", 2)
)
total = 0
for product in products:
    total += product[1]
print("Загальна кількість товарів:", total)
# Завдання 6
# Напишіть програму, яка приймає список кортежів з інформацією про книги (назва, автор, рік
# видання) та виводить список авторів без повторень.
# Приклад вхідних даних: [('Майстер і Маргарита', 'Михайло Булаков', 1967), ('Злочин і покарання',
# 'Федор Достоєвський', 1866), ('Війна і мир', 'Лев Толстой', 1869), ('1984', 'Джордж Оруелл', 1949)]
# Очікуваний висновок: Список авторів без повторень:
# Михайло Булгаков
# Федір Достоєвський
# Лев Толстой
# Джордж Орвелл
books = (
    ("Майстер і Маргарита", "Михайло Булгаков", 1967),
    ("Злочин і покарання", "Федір Достоєвський", 1866),
    ("Війна і мир", "Лев Толстой", 1869),
    ("1984", "Джордж Орвелл", 1949),
    ("Колгосп тварин", "Джордж Орвелл", 1945)
)
authors = set()
for book in books:
    authors.add(book[1])
print("Список авторів:")
for author in authors:
    print(author)