# Завдання 1
# # Напишіть програму, яка запитує в користувача число й обчислює його квадратний
# # корінь.
# #  У блоці try перетворіть введення в число і перевірте, що воно не від'ємне.
# #  Якщо число від'ємне, згенеруйте виняток (raise Exception("Не можна обчислити
# # квадратний корінь від'ємного числа")).
# #  Перехопіть ValueError і згенероване виключення, виведіть відповідне
# # повідомлення.
# #  У блоці finally виведіть повідомлення про завершення обчислень.

try:
    number = int(input("Enter a number - "))
    if number < 0:
        raise Exception("Не можна обчислити квадратний корінь від'ємного числа")
    square = number ** 0.5
    print("Square root-" , square)
except ValueError:
    print("Error")
except Exception as ex:
    print(ex)
finally:
     print("finish")